#ifndef _TSS_H_
#define _TSS_H_

#include <datatype.h>
#include <lib/string.h>
#include <mm/zone.h>
#include <x86_64/desc.h>

#define IST_ORDER 0

#pragma pack(push, 1)
typedef struct tss
{
    // ╔══════════════════════════════════════════════════════╗
    // ║              Legacy 部分（4字节，忽略）             ║
    // ╚══════════════════════════════════════════════════════╝
    uint32_t reserved0; // 忽略，必须为 0

    // ╔══════════════════════════════════════════════════════╗
    // ║     特权级栈指针（每个字段 8 字节，核心字段）      ║
    // ║   当 IDT 的 IST=0 时，根据目标特权级选择对应栈     ║
    // ╚══════════════════════════════════════════════════════╝
    uint64_t rsp0; // Ring 0 任务栈 → 内核主要使用的栈。IST=0 且切换至 Ring0 时加载至 RSP
    uint64_t rsp1; // Ring 1 任务栈 → 极少数 OS 使用，设为 0
    uint64_t rsp2; // Ring 2 任务栈 → 极少数 OS 使用，设为 0

    // ╔══════════════════════════════════════════════════════╗
    // ║             保留字段（8字节，忽略）                 ║
    // ╚══════════════════════════════════════════════════════╝
    uint32_t reserved1; // 忽略，必须为 0
    uint32_t reserved2; // 忽略，必须为 0

    // ╔══════════════════════════════════════════════════════╗
    // ║ 中断栈表（每个字段 8 字节，IST 机制的核心）        ║
    // ║ 当 IDT 描述符中 IST 字段 (1-7) 非 0 时使用         ║
    // ╚══════════════════════════════════════════════════════╝
    uint64_t ist1; // IST 1 中断栈指针
    uint64_t ist2; // IST 2
    uint64_t ist3; // IST 3
    uint64_t ist4; // IST 4
    uint64_t ist5; // IST 5
    uint64_t ist6; // IST 6
    uint64_t ist7; // IST 7

    // ╔══════════════════════════════════════════════════════╗
    // ║             保留字段（8字节，忽略）                 ║
    // ╚══════════════════════════════════════════════════════╝
    uint32_t reserved3; // 忽略，必须为 0
    uint32_t reserved4; // 忽略，必须为 0

    // ╔══════════════════════════════════════════════════════╗
    // ║        保留字与 I/O 权限位图基址（4字节）          ║
    // ╚══════════════════════════════════════════════════════╝
    uint16_t reserved5;   // 忽略，必须为 0
    uint16_t iopb_offset; // I/O 权限位图偏移，设为 sizeof(TSS) 即表示无位图

} tss_t;
#pragma pack(pop)

tss_t *local_tss_init(mmnode_t *node, size_t cpu_logic_id);

#endif
